Q1. List any five functions of the pandas library with execution.

In [ ]:
Ans : 
    The five functions of the pandas library are :
    1. head() 
    2. describe()
    3. dropna()
    4. fillna()
    5. apply()

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [1]:
import pandas as pd
data = {
    "A" : ["Alice","Bob","Claire","Ali","Rambo"],
    "B" : [25,30,27,19,23],
    "C" : ["Female","Male","Female","Male","Male"]
}
df = pd.DataFrame(data)
df

        A   B       C
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female
3     Ali  19    Male
4   Rambo  23    Male

In [2]:
df = df.reindex([i for i in range(0,9,2)])

In [3]:
df

        A     B       C
0   Alice  25.0  Female
2  Claire  27.0  Female
4   Rambo  23.0    Male
6     NaN   NaN     NaN
8     NaN   NaN     NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [4]:
data = {"Values" : [10,20,30,40,50]}
df1 = pd.DataFrame(data)
df1

   Values
0      10
1      20
2      30
3      40
4      50

In [5]:
df1["Values"].iloc[:3].sum()

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [6]:
data = [
    {"Text": "This is the first sentence."},
    {"Text": "Here comes the second sentence."},
    {"Text": "The third sentence is now appearing."},
    {"Text": "Number four is right here."},
    {"Text": "Finally, the fifth sentence concludes."}
]
df2 = pd.DataFrame(data)
df2

                                     Text
0             This is the first sentence.
1         Here comes the second sentence.
2    The third sentence is now appearing.
3              Number four is right here.
4  Finally, the fifth sentence concludes.

In [7]:
df2["Word_Count"] = df2["Text"].apply(lambda x : len(x.split()))

In [8]:
df2

                                     Text  Word_Count
0             This is the first sentence.           5
1         Here comes the second sentence.           5
2    The third sentence is now appearing.           6
3              Number four is right here.           5
4  Finally, the fifth sentence concludes.           5

Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans.
    DataFrame.size:
        It represents the total count of values in the DataFrame, including all rows and columns.
        it simply returns the count of elements.
    DataFrame.shape:
        The shape is represented as (number_of_rows, number_of_columns).

In [9]:
import pandas as pd
df = pd.DataFrame({'Text':['Hii Everyone','My name is Avinash','I am learning Data Science']})
df

                         Text
0                Hii Everyone
1          My name is Avinash
2  I am learning Data Science

In [10]:
df.size

3

In [11]:
df.shape

(3, 1)

Q6. Which function of pandas do we use to read an excel file?

In [12]:
import pandas as pd
df1 = pd.read_excel("LUSID Excel - Setting up your market data.xlsx")

In [13]:
df1.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,This sheet allows you to format datetimes for...,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,If you have any questions please visit our:,NaN,NaN,NaN,NaN,NaN,NaN

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [19]:
import pandas as pd

data2 = {
    "name": ["Aarav", "Aditi", "Ishaan", "Neha", "Vikram"],
    "email": ["aarav@gmail.com", "aditi@gmail.com", "ishaan@gmail.com", "neha@gmail.com", "vikram@gmail.com"]
}

df4 = pd.DataFrame(data2)
df4

     name             email
0   Aarav   aarav@gmail.com
1   Aditi   aditi@gmail.com
2  Ishaan  ishaan@gmail.com
3    Neha    neha@gmail.com
4  Vikram  vikram@gmail.com

In [33]:
df4["Username"] = df4["email"].str.split('@').str[0]

In [34]:
df4

     name             email Username
0   Aarav   aarav@gmail.com    aarav
1   Aditi   aditi@gmail.com    aditi
2  Ishaan  ishaan@gmail.com   ishaan
3    Neha    neha@gmail.com     neha
4  Vikram  vikram@gmail.com   vikram

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [1]:
import pandas as pd
df6 = pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})
df6

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [2]:
df6[(df6['A'] > 5) & (df6['B'] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [3]:
import pandas as pd
df = pd.DataFrame({'Values':[10,20,30,40,50,60,70,80,90,100]})

In [4]:
df.describe()

           Values
count   10.000000
mean    55.000000
std     30.276504
min     10.000000
25%     32.500000
50%     55.000000
75%     77.500000
max    100.000000

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [5]:
import pandas as pd
df = pd.DataFrame({'Sales':[1000,2000,3000,4000,5000,6000,7000,14000],
                   'Date':['01-06-2023','02-06-2023','03-06-2023','04-06-2023','05-06-2023','06-06-2023','07-06-2023','08-06-2023']})

In [8]:
df['Moving average'] = df['Sales'].rolling(window=7 , min_periods = 1).mean()
df

   Sales        Date  Moving average
0   1000  01-06-2023     1000.000000
1   2000  02-06-2023     1500.000000
2   3000  03-06-2023     2000.000000
3   4000  04-06-2023     2500.000000
4   5000  05-06-2023     3000.000000
5   6000  06-06-2023     3500.000000
6   7000  07-06-2023     4000.000000
7  14000  08-06-2023     5857.142857

In [ ]:
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [2]:
import pandas as pd
df = pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [3]:
df["Date"] = pd.to_datetime(df["Date"])
df.dtypes

Date    datetime64[ns]
dtype: object

In [8]:
df["Weekday"] = df["Date"].dt.day_name()

In [9]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [17]:
import pandas as pd
df = pd.DataFrame({'Date':
                   ['2023-01-01','2023-01-07','2023-03-01','2023-01-16','2024-01-01','2023-01-26','2023-03-27']})
df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]

         Date
0  2023-01-01
1  2023-01-07
3  2023-01-16
5  2023-01-26

In [ ]:
Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Ans :
    import pandas as pd

 * the pandas library, you gain access to all the functions and data structures provided by pandas,
    allowing you to work with DataFrames, Series, and perform various data manipulation and analysis operations.